tutorials/7.1.3.1D_2phase_2componentGas_YCO2i_0_compositionalDarcyFoam_mutual_slbty_U_0.5_no_write/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  foam-extend 5.0
    \\  /    A nd           | PorousMedia: A Wikki Brasil project
     \\/     M anipulation  | Solver: coupledMatrixFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                             Euler;
}

gradSchemes
{
    default                             Gauss linear;
}

divSchemes
{
    default                             Gauss linear;
    div(phip,alpha)                     Gauss upwind;
    div(phig,alpha)                     Gauss limitedLinear 1;
}

laplacianSchemes
{
    default                             Gauss linear uncorrected;
}

interpolationSchemes
{
    default                             linear;
}

snGradSchemes
{
    default                             uncorrected;
}

// ************************************************************************* //
